str = input("текст:\n")
ln = {
    "А": "A",  "а": "a",
    "Б": "B",  "б": "b",
    "В": "V",  "в": "v",
    "Г": "G",  "г": "g",
    "Д": "D",  "д": "d",
    "Е": "E",  "е": "e",
    "Ё": "E",  "ё": "e",
    "Ж": "Zh", "ж": "zh",
    "З": "Z",  "з": "z",
    "И": "I",  "и": "i",
    "Й": "I",  "й": "i",
    "К": "K",  "к": "k",
    "Л": "L",  "л": "l",
    "М": "M",  "м": "m",
    "Н": "N",  "н": "n",
    "О": "O",  "о": "o",
    "П": "P",  "п": "p",
    "Р": "R",  "р": "r",
    "С": "S",  "с": "s",
    "Т": "T",  "т": "t",
    "У": "U",  "у": "u",
    "Ф": "F",  "ф": "f",
    "Х": "Kh", "х": "kh",
    "Ц": "Ts", "ц": "ts",
    "Ч": "Ch", "ч": "ch",
    "Ш": "Sh", "ш": "sh",
    "Щ": "Shch", "щ": "shch",
    "Ъ": "Ie", "ъ": "ie",
    "Ы": "Y",  "ы": "y",
    "Ь": "",   "ь": "",
    "Э": "E",  "э": "e",
    "Ю": "Iu", "ю": "iu",
    "Я": "Ia", "я": "ia",
}

str1 = ""

for n in str:
    if n in ln:
        str1 += ln[n]
    else:
        str1 += n
print(str1)